import React from "react";

const About = () => {
  return (
    <>
      <h1 style={{margin: '30px 0'}}>ТЕСТОВЫЙ САЙТ ДЛЯ ИЗУЧЕНИЯ РАБОТЫ REACT</h1>
      <h2>Использованные технологии</h2>
      <ul style={{margin: '30px 0 0'}}>
        <li>Роутинг</li>
        <li>Подключение сторонних библиотек</li>
        <li>
          Использование функционального подхода с хуками в том числе и
          кастомными
        </li>
        <li>Модальное окно</li>
        <li>Пагинация страниц</li>
        <li>Использование контекста</li>
      </ul>
    </>
  );
};

export default About;
